turbinesFoam/validation/phaseVI/case/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  www.openfoam.com                      |
|   \\  /    A nd           |                                                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// Generated from config/case.yaml. Do not edit by hand.

scale 1;

vertices
(
    (-50.29 -40.232 -12.953)
    (-5.029 -40.232 -12.953)
    (80.464 -40.232 -12.953)
    (150.87 -40.232 -12.953)
    (-50.29 -15.087 -12.953)
    (-5.029 -15.087 -12.953)
    (80.464 -15.087 -12.953)
    (150.87 -15.087 -12.953)
    (-50.29 15.087 -12.953)
    (-5.029 15.087 -12.953)
    (80.464 15.087 -12.953)
    (150.87 15.087 -12.953)
    (-50.29 40.232 -12.953)
    (-5.029 40.232 -12.953)
    (80.464 40.232 -12.953)
    (150.87 40.232 -12.953)
    (-50.29 -40.232 12.192)
    (-5.029 -40.232 12.192)
    (80.464 -40.232 12.192)
    (150.87 -40.232 12.192)
    (-50.29 -15.087 12.192)
    (-5.029 -15.087 12.192)
    (80.464 -15.087 12.192)
    (150.87 -15.087 12.192)
    (-50.29 15.087 12.192)
    (-5.029 15.087 12.192)
    (80.464 15.087 12.192)
    (150.87 15.087 12.192)
    (-50.29 40.232 12.192)
    (-5.029 40.232 12.192)
    (80.464 40.232 12.192)
    (150.87 40.232 12.192)
    (-50.29 -40.232 37.337)
    (-5.029 -40.232 37.337)
    (80.464 -40.232 37.337)
    (150.87 -40.232 37.337)
    (-50.29 -15.087 37.337)
    (-5.029 -15.087 37.337)
    (80.464 -15.087 37.337)
    (150.87 -15.087 37.337)
    (-50.29 15.087 37.337)
    (-5.029 15.087 37.337)
    (80.464 15.087 37.337)
    (150.87 15.087 37.337)
    (-50.29 40.232 37.337)
    (-5.029 40.232 37.337)
    (80.464 40.232 37.337)
    (150.87 40.232 37.337)
);

blocks
(
    hex (0 1 5 4 16 17 21 20) (50 36 52) simpleGrading (0.160029 0.24124 0.4464)
    hex (1 2 6 5 17 18 22 21) (272 36 52) simpleGrading (1 0.24124 0.4464)
    hex (2 3 7 6 18 19 23 22) (60 36 52) simpleGrading (9.252929 0.24124 0.4464)
    hex (4 5 9 8 20 21 25 24) (50 96 52) simpleGrading (0.160029 1 0.4464)
    hex (5 6 10 9 21 22 26 25) (272 96 52) simpleGrading (1 1 0.4464)
    hex (6 7 11 10 22 23 27 26) (60 96 52) simpleGrading (9.252929 1 0.4464)
    hex (8 9 13 12 24 25 29 28) (50 36 52) simpleGrading (0.160029 4.145249 0.4464)
    hex (9 10 14 13 25 26 30 29) (272 36 52) simpleGrading (1 4.145249 0.4464)
    hex (10 11 15 14 26 27 31 30) (60 36 52) simpleGrading (9.252929 4.145249 0.4464)
    hex (16 17 21 20 32 33 37 36) (50 36 52) simpleGrading (0.160029 0.24124 2.2404)
    hex (17 18 22 21 33 34 38 37) (272 36 52) simpleGrading (1 0.24124 2.2404)
    hex (18 19 23 22 34 35 39 38) (60 36 52) simpleGrading (9.252929 0.24124 2.2404)
    hex (20 21 25 24 36 37 41 40) (50 96 52) simpleGrading (0.160029 1 2.2404)
    hex (21 22 26 25 37 38 42 41) (272 96 52) simpleGrading (1 1 2.2404)
    hex (22 23 27 26 38 39 43 42) (60 96 52) simpleGrading (9.252929 1 2.2404)
    hex (24 25 29 28 40 41 45 44) (50 36 52) simpleGrading (0.160029 4.145249 2.2404)
    hex (25 26 30 29 41 42 46 45) (272 36 52) simpleGrading (1 4.145249 2.2404)
    hex (26 27 31 30 42 43 47 46) (60 36 52) simpleGrading (9.252929 4.145249 2.2404)
);

edges ();

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 16 20 4)
            (4 20 24 8)
            (8 24 28 12)
            (16 32 36 20)
            (20 36 40 24)
            (24 40 44 28)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (3 7 23 19)
            (7 11 27 23)
            (11 15 31 27)
            (19 23 39 35)
            (23 27 43 39)
            (27 31 47 43)
        );
    }
    bottom
    {
        type symmetryPlane;
        faces
        (
            (0 4 5 1)
            (1 5 6 2)
            (2 6 7 3)
            (4 8 9 5)
            (5 9 10 6)
            (6 10 11 7)
            (8 12 13 9)
            (9 13 14 10)
            (10 14 15 11)
        );
    }
    top
    {
        type symmetryPlane;
        faces
        (
            (32 33 37 36)
            (33 34 38 37)
            (34 35 39 38)
            (36 37 41 40)
            (37 38 42 41)
            (38 39 43 42)
            (40 41 45 44)
            (41 42 46 45)
            (42 43 47 46)
        );
    }
    sideMinus
    {
        type symmetryPlane;
        faces
        (
            (0 1 17 16)
            (1 2 18 17)
            (2 3 19 18)
            (16 17 33 32)
            (17 18 34 33)
            (18 19 35 34)
        );
    }
    sidePlus
    {
        type symmetryPlane;
        faces
        (
            (12 28 29 13)
            (13 29 30 14)
            (14 30 31 15)
            (28 44 45 29)
            (29 45 46 30)
            (30 46 47 31)
        );
    }
);

mergePatchPairs ();
