turbinesFoam/validation/phaseVI/case/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  www.openfoam.com                      |
|   \\  /    A nd           |                                                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// Generated from config/case.yaml. Do not edit by hand.

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (7 0 0);

boundaryField
{
    inlet
    {
        type fixedValue;
        value uniform (7 0 0);
    }

    outlet
    {
        type inletOutlet;
        inletValue uniform (0 0 0);
        value uniform (7 0 0);
    }

    bottom
    {
        type symmetryPlane;
    }
    top
    {
        type symmetryPlane;
    }
    sideMinus
    {
        type symmetryPlane;
    }
    sidePlus
    {
        type symmetryPlane;
    }
}
